
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВнешнююКомпоненту("Обработка.ИнформацияОбУстройстве.Макет.Компонента");
	
	Подключена = ПодключитьВнешнююКомпоненту("Обработка.ИнформацияОбУстройстве.Макет.Компонента", "infostart_event_2018_devinfo", ТипВнешнейКомпоненты.Native);
	
	Если Не Подключена Тогда
	
		Сообщить("Не удалось подключить компоненту");
	
	КонецЕсли; 
	
	Компонента = Новый("AddIn.infostart_event_2018_devinfo.InfoExtension");

	Модель = Компонента.ПолучитьМодельУстройства();
	Система = Компонента.ПолучитьСистемнуюИнформацию();
	Версия = Компонента.ПолучитьВерсиюСистемы();
	УровеньЗаряда = Компонента.ПолучитьУровеньЗарядаБатареи();
	ИдентификаторДляВендора = Компонента.ПолучитьИдентификаторДляВендора();
	
КонецПроцедуры
