
&НаКлиенте
Перем Компонента;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВнешнююКомпоненту("Обработка.СобытиеБлокировки.Макет.Компонента");
	
	Подключена = ПодключитьВнешнююКомпоненту("Обработка.СобытиеБлокировки.Макет.Компонента", "infostart_event_2018_lockevent", ТипВнешнейКомпоненты.Native);
	
	Если Не Подключена Тогда
	
		Сообщить("Не удалось подключить компоненту");
	
	КонецЕсли; 
	
	Компонента = Новый("AddIn.infostart_event_2018_lockevent.LockEventExtension");
	
КонецПроцедуры

&НаКлиенте
Процедура СлежениеПриИзменении(Элемент)
	Компонента.АктивироватьСлежение(Слежение);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщениеЛога(Сообщение)

	Если ЗначениеЗаполнено(Лог) Тогда
	
		Лог = Лог + Символы.ПС;
	
	КонецЕсли; 
	
	Лог = Лог + СтрШаблон("[%1] %2", ТекущаяДата(), Сообщение);

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "LockEventListener" Тогда
	
		ДобавитьСообщениеЛога(Событие); 
	
	КонецЕсли;
	
КонецПроцедуры
 